# AssetSetIterator Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetSetIterator Class
Members See Also
---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class AssetSetIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class AssetSetIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class AssetSetIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Visual..::..AssetSetIterator
# See Also
AssetSetIterator Members
Autodesk.Revit.DB.Visual Namespace